#include <iostream>
using namespace std;
/*
    في البداية الفرق بين الاوبجكت والكلاس هو ان الكلاس عبارة عن تعريف للصفات الخاصة بالاوبجكت والاوبجكت يندرج تحت الكلاس
    (BMW)يعني زي ما تحكي انو الكلاس هوا سيارة والاوبجكت هوا
    */

 /*  يمكن انشاء اكثر من كائن لنفس الكلاس عن طريق ادراجهم تحت نفس الكلاس car a,b;
 وعند ادخال قيمة لكائن او استدعاء دالة له لن يتأثر الكائن الأخر المندرج تحت نفس الكلاس
 */

/*أولا صنع الكلاس ويجب ان يتضمن 3 اشياء اساسية وهي أمر كلاس ثم
أمر ببليك ثم الصفات المندرجة تحت الكلام ثم الفنكشنز
اللي يتعبر عن الأحداث اللي بتصير
*/
class car {

//يقوم المبرمجين في العادة بوضع الخصائص في البرايفت بينما يضعوا الفنكشنز في الببليك
//اذا لم تضع ببلك او برايفيت في الكلاس فسيكون ما داخله برايفت تلقائيا
//يطلق على البرايف والببلك محددات الوصول بالانجليزية اكسسز موديفايرز

private :// هنا لا يمكن العبث بالمعلومات المعطاه
    int maxspeed;
    int speed=0;
public  : //هنا يمكن التغيير في المعلومات
    string company;
    int model;

    void go() {                                 //دالة انطلاق
        speed = 20;
        cout << speed << endl;

    }
    void speed_up() {                           //دالة تسريع
        speed += 20;
        cout << speed << endl;
    
    }
    void stop (){                               //دالة توقف
        speed = 0;
        cout << speed << endl;

    }

};


int main()
{
    /*  وطبعا بنحطو يندرج لكلاس معين وبعدها بنحدد صفاتو 
    (a) ثانيا الاوبجكت وهو عبارة عن تسمية فرضناها هنا 
    وبعدها الفنكشنز اللي عن طريقها بنغير الصفات وممكن نحط شروط معينة لتغيير الصفات 
    */
    car a;
    a.company = "BMW";
    a.model = 1990;
    a.go();//هكذا نقوم باستدعاء الدوال
    a.speed_up();
    a.speed_up();
    a.stop();

    //بما ان سبيد هي برايفت فلا يمكن العبث بها الا عن طريق استدعاء الدوال الموجودة بالفعل في الكلاس
    //وأيضا لا يمكن اخراج السرعة او ادخالها او التعامل معها خارج الكلاس الا عن طريق دالة تربطها بالكلاس حيث ان
    //الدالة الموجودة قي الكلاس يمكن وضع فيها عملية التزويد والاخراج غير ذلك لا يمكنك التعامل مع الصفات في البرايفت







    return 0;

}
